{"userStory":{"id":297,"what":"I want to update my User profile","who":"AuthenticatedUser","why":"so that I can connect with other Drupalists at BADCamp."},"questions":[{"question":{"id":3,"descricao":"Does the user story implementation involve any sensitive transactions, data, or API?"},"done":true,"questoesEspecificas":[{"question":{"id":7,"descricao":"Does the user story implementation involve any sensitive transactions or account modification?","fk_Questao_Geral_id":3},"done":true,"requirements":[{"descricao":"Verify the application ensures a full, valid login session or requires re-authentication or secondary verification before allowing any sensitive transactions or account modifications.","id":39,"id_externo":"V3.7.1","fk_Secao_id":29,"fk_Questao_Especifica_id":7,"nivel":"L1","marked":true}]},{"question":{"id":8,"descricao":"Does the user story implementation involve using any sensitive data or API ?","fk_Questao_Geral_id":3},"done":true,"requirements":[{"descricao":"Verify API URLs do not expose sensitive information, such as the API key, session tokens etc.","id":109,"id_externo":"V13.1.3","fk_Secao_id":61,"fk_Questao_Especifica_id":8,"nivel":"L1","marked":true},{"descricao":"Verify that all application components use the same encodings and parsers to avoid parsing attacks that exploit different URI or file parsing behavior that could be used in SSRF and RFI attacks.","id":108,"id_externo":"V13.1.1","fk_Secao_id":61,"fk_Questao_Especifica_id":8,"nivel":"L1","marked":true},{"descricao":"Verify that all sensitive data created and processed by the application has been identified, and ensure that a policy is in place on how to deal with sensitive data. ([C8](https://owasp.org/www-project-proactive-controls/#div-numbering))","id":85,"id_externo":"V8.3.4","fk_Secao_id":48,"fk_Questao_Especifica_id":8,"nivel":"L1","marked":true},{"descricao":"Verify that sensitive data and APIs are protected against Insecure Direct Object Reference (IDOR) attacks targeting creation, reading, updating and deletion of records, such as creating or updating someone else's record, viewing everyone's records, or deleting all records.","id":44,"id_externo":"V4.2.1","fk_Secao_id":31,"fk_Questao_Especifica_id":8,"nivel":"L1","marked":true},{"descricao":"Verify that sensitive data is sent to the server in the HTTP message body or headers, and that query string parameters from any HTTP verb do not contain sensitive data.","id":82,"id_externo":"V8.3.1","fk_Secao_id":48,"fk_Questao_Especifica_id":8,"nivel":"L1","marked":true},{"descricao":"Verify that users are provided clear language regarding collection and use of supplied personal information and that users have provided opt-in consent for the use of that data before it is used in any way.","id":84,"id_externo":"V8.3.3","fk_Secao_id":48,"fk_Questao_Especifica_id":8,"nivel":"L1","marked":true}]}]},{"question":{"id":5,"descricao":"Does the user story implementation involve input from the client or the environment?"},"done":true,"questoesEspecificas":[{"question":{"id":10,"descricao":"Does the user story implementation involve input from the client or the environment?","fk_Questao_Geral_id":5},"done":true,"requirements":[{"descricao":"Verify that all input (HTML form fields, REST requests, URL parameters, HTTP headers, cookies, batch files, RSS feeds, etc) is validated using positive validation (allow lists). ([C5](https://owasp.org/www-project-proactive-controls/#div-numbering))","id":50,"id_externo":"V5.1.3","fk_Secao_id":33,"fk_Questao_Especifica_id":10,"nivel":"L1","marked":true},{"descricao":"Verify that structured data is strongly typed and validated against a defined schema including allowed characters, length and pattern (e.g. credit card numbers, e-mail addresses, telephone numbers, or validating that two related fields are reasonable, such as checking that suburb and zip/postcode match). ([C5](https://owasp.org/www-project-proactive-controls/#div-numbering))","id":51,"id_externo":"V5.1.4","fk_Secao_id":33,"fk_Questao_Especifica_id":10,"nivel":"L1","marked":true}]}]}],"finished":"2025-04-26T19:27:21.439Z","started":"2025-04-26T19:24:09.667Z"}